/*
 * The MIT License (MIT)
 *
 * Copyright (c) 2021 Koji KITAYAMA
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 *
 * This file is part of the TinyUSB stack.
 */

#include <string.h>

#include <hal/kernel.h>
#include <hal/device.h>
#include <hal/console.h>
#include <hal/kmem.h>
#include <hal/pinctrl.h>
#include <hal/spi-flash.h>
#include <hal/timer.h>
#include <hal/unaligned.h>
#include <hal/clk.h>

#include "tusb_option.h"
#include "device/dcd.h"
#include "device/usbd_pvt.h"
#include "musbhsfc_type.h"

/*------------------------------------------------------------------
 * MACRO TYPEDEF CONSTANT ENUM DECLARATION
 *------------------------------------------------------------------*/
#define REQUEST_TYPE_INVALID  (0xFFu)
#define ISSUE_WISE_1122   /* (1) Remove a race condition
							 between end of STATUS stage of one control transfer
							 and start of SETUP stage of the next control transfer.
							 (2) Mitigate missing STATUS OUT interrupt
						  */


typedef struct TU_ATTR_PACKED {
  uint8_t  FADDR;        /* 00h */
  uint8_t  POWER;        /* 01h */
  uint16_t INTRTX;       /* 02h */
  uint16_t INTRRX;       /* 04h */
  uint16_t INTRTXE;      /* 06h */
  uint16_t INTRRXE;      /* 08h */
  uint8_t  INTRUSB;      /* 0Ah */
  uint8_t  INTRUSBE;     /* 0Bh */
  uint16_t FRAME;        /* 0Ch */
  uint8_t  INDEX;        /* 0Eh */
  uint8_t  TESTMODE;     /* 0Fh */
} hw_common_t;

typedef struct TU_ATTR_PACKED {
  uint16_t TXMAXP;       /* 10h */
  uint8_t  TXCSRL;       /* 12h */
  uint8_t  TXCSRH;       /* 13h */
  uint16_t RXMAXP;       /* 14h */
  uint8_t  RXCSRL;       /* 16h */
  uint8_t  RXCSRH;       /* 17h */
  uint16_t RXCOUNT;      /* 18h */
  uint16_t RESERVED[3];  /* TO DO: Dynamic FIFO */
} hw_endpoint_t;

/* Aliases for Endpoint 0 */
#define    CSRL0   TXCSRL
#define    COUNT0  RXCOUNT

typedef union {
  uint8_t   byte;
  uint16_t  hword;
  uint32_t  word;
} hw_fifo_t;

typedef struct TU_ATTR_PACKED {
  uint16_t RESERVED1[6];
  uint16_t HWVERS;       /* 6Ch */
  uint16_t RESERVED2[5];
  uint8_t  EPINFO;       /* 78h */
  uint8_t  RAMINFO;      /* 79h */
  uint8_t  SOFTRST;      /* 7Ah */
  uint8_t  ERLYDMA;      /* 7Bh */
  uint16_t RESERVED3[2];
  uint16_t C_T_UCH;      /* 80h */
  uint16_t RESERVED4;
  uint16_t C_T_HSRTN;    /* 84h */
} hw_misc_cfg_t;

typedef struct TU_ATTR_PACKED {
  hw_common_t   common;
  hw_endpoint_t endpt;
  hw_fifo_t     fifo[16];/* 20h - 5Ch */
  hw_misc_cfg_t mcfg;
} hw_regmap_t;

typedef struct TU_ATTR_PACKED {
  uint32_t INTR;         /* reserved when ch != 0 */
  uint32_t CNTL;
  uint32_t ADDR;
  uint32_t COUNT;
} hw_dmactl_t;

typedef struct TU_ATTR_PACKED {
  hw_dmactl_t   dmach[CFG_TUD_NUM_DMA_CHANNELS];
} hw_dmamap_t;

struct pipe_state_s;
typedef struct
{
  int8_t ch;              /* -1 if not used */
  int8_t mode;
  struct pipe_state_s *pipe;
  bool sticky;
} dma_state_t;

typedef struct pipe_state_s
{
  void        *buf;      /* the start address of a transfer data buffer */
  uint16_t    length;    /* the number of bytes in the buffer */
  uint16_t    remaining; /* the number of bytes remaining in the buffer */
  int8_t      rhport;
  int8_t      epnum;
  int8_t      dir_in;
  dma_state_t *dma;
} pipe_state_t;

typedef struct
{
  int8_t       rhport;
  int8_t       irq;
  int8_t       irq_dma;
  volatile hw_regmap_t *base;
  volatile hw_dmamap_t *dmac;

